Public Attributes | List of all members
API_RailingVerticalPosData Struct Reference
Element Manager
Represents the vertical position of a Railing subelement. More...
#include <APIdefs_Elements.h>
 Public Attributes
 UInt32  | bottomRailIndex
The index of the bottom rail.
 UInt32  | topRailIndex
The index of the top rail.
Detailed Description
Represents the vertical position of a Railing subelement.
Remarks
The vertical position of a railing subelement calculates the bottom offset and height of a subelement by giving it boundaries between two rails.